Revit 2027 API
SpatialElement.GetSpatialElementDomainData Method
 Gets the domain data for the spatial element. The domain data contains information of different spatial elements, such as electrical load area. Currently room/space/area don't have domain data.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public SpatialElementDomainData GetSpatialElementDomainData()
Public Function GetSpatialElementDomainData As SpatialElementDomainData
public:
SpatialElementDomainData^ GetSpatialElementDomainData()
member GetSpatialElementDomainData : unit -> SpatialElementDomainData
Return Value
SpatialElementDomainData
 Returns a pointer to the base class for specific domain requirements for the spatial element.
See Also
Reference
SpatialElement Class
Autodesk.Revit.DB Namespace